import Mock from 'mockjs'

export default [
    {
        url:'/user/query_deparment',
        type:'get',
        response:()=>{
            return {
                code:200,
                data:{
                    
                        "内科":{
                            "呼吸内科":{
                                "主任":"呼吸内科11",
                                "副主任":"呼吸内科2",
                                "主治医师":["呼吸内科3","呼吸内科4"]
                            },
                            "消化内科":{
                                "主任":"消化内科1",
                                "副主任":"消化内科2",
                                "主治医师":["消化内科3","消化内科4"]
                            },
                            "神经内科":{
                                "主任":"神经内科1",
                                "副主任":"神经内科2",
                                "主治医师":["神经内科3","神经内科4"]
                            },
                            "心血管内科":{
                                "主任":"心血管内科1",
                                "副主任":"心血管内科2",
                                "主治医师":["心血管内科3","心血管内科4"]
                            }
                        },
                    
                        "外科":{
                            "普通外科":{
                                "主任":"普通外科1",
                                "副主任":"普通外科2",
                                "主治医师":["普通外科3","普通外科4"]
                            },
                            "神经外科":{
                                "主任":"神经外科1",
                                "副主任":"神经外科2",
                                "主治医师":["神经外科3","神经外科4"]
                            },
                            "心胸外科":{
                                "主任":"心胸外科1",
                                "副主任":"心胸外科2",
                                "主治医师":["心胸外科3","心胸外科4"]
                            },
                            "泌尿外科":{
                                "主任":"泌尿外科1",
                                "副主任":"泌尿外科2",
                                "主治医师":["泌尿外科3","泌尿外科4"]
                            },
                            "骨科":{
                                "主任":"吴朝晖",
                                "副主任":"竺可桢",
                                "主治医师":["林建华"]
                            }
                        },
                    
                        "儿科":{
                            "儿科综合":{
                                "主任":"儿科综合1",
                                "副主任":"儿科综合2",
                                "主治医师":["儿科综合3","儿科综合4"]
                            },
                            "小儿内科":{
                                "主任":"小儿内科1",
                                "副主任":"小儿内科2",
                                "主治医师":["小儿内科3","小儿内科4"]
                            },
                            "小儿外科":{
                                "主任":"小儿外科1",
                                "副主任":"小儿外科2",
                                "主治医师":["小儿外科3","小儿外科4"]
                            },
                            "新生儿科":{
                                "主任":"新生儿科1",
                                "副主任":"新生儿科2",
                                "主治医师":["新生儿科3","新生儿科4"]
                            }
                        },
                    
                        "中医科":{
                            "中医全科":{
                                "主任":"中医全科1",
                                "副主任":"中医全科2",
                                "主治医师":["中医全科3","中医全科4"]
                            },
                            "中医内科":{
                                "主任":"中医内科1",
                                "副主任":"中医内科2",
                                "主治医师":["中医内科3","中医内科4"]
                            },
                            "中医外科":{
                                "主任":"中医外科1",
                                "副主任":"中医外科2",
                                "主治医师":["中医外科3","中医外科4"]
                            },
                            "针灸按摩科":{
                                "主任":"针灸按摩科1",
                                "副主任":"针灸按摩科2",
                                "主治医师":["针灸按摩科3","针灸按摩科4"]
                            },
                            "中医骨伤科":{
                                "主任":"中医骨伤科1",
                                "副主任":"中医骨伤科2",
                                "主治医师":["中医骨伤科3","中医骨伤科4"]
                            }
                        },
                    
                        "传染科":{
                            "肝病科":{
                                "主任":"肝病科1",
                                "副主任":"肝病科2",
                                "主治医师":["肝病科3","肝病科4"]
                            },
                            "艾滋病科":{
                                "主任":"艾滋病科1",
                                "副主任":"艾滋病科2",
                                "主治医师":["艾滋病科3","艾滋病科4"]
                            },
                            "寄生虫科":{
                                "主任":"寄生虫科1",
                                "副主任":"寄生虫科2",
                                "主治医师":["寄生虫科3","寄生虫科4"]
                            }
                        },
                    
                        "肿瘤科":{
                            "放疗科":{
                                "主任":"放疗科1",
                                "副主任":"放疗科2",
                                "主治医师":["放疗科3","放疗科4"]
                            },
                            "肿瘤综合科":{
                                "主任":"肿瘤综合科1",
                                "副主任":"肿瘤综合科2",
                                "主治医师":["肿瘤综合科3","肿瘤综合科4"]
                            },
                            "骨肿瘤科":{
                                "主任":"骨肿瘤科1",
                                "副主任":"骨肿瘤科2",
                                "主治医师":["骨肿瘤科3","骨肿瘤科4"]
                            }
                        },
                    
                        "五官科":{
                            "耳鼻喉科":{
                                "主任":"张华",
                                "副主任":"赵云",
                                "主治医师":["耳鼻喉科3","耳鼻喉科4"]
                            },
                            "眼科":{
                                "主任":"李明",
                                "副主任":"王刚",
                                "主治医师":["眼科3","眼科4"]
                            },
                            "口腔科":{
                                "主任":"口腔科1",
                                "副主任":"口腔科2",
                                "主治医师":["口腔科3","口腔科4"]
                            }
                        }
                    
                }
            }
        }
    },
    /*
    {
        url:'/getdepartinfo',
        type:'get',
        response:()=>{
            return {
                data:{
                        "name":"精神科",
                        "intro":"精神科成立于20世纪80年代，是全国综合医院成立最早的精神科门诊之一。科室现有5名医生，1名护士，其中副主任医师2人、主治医师1人，博士1名、硕士4人。以认识领悟疗法、人本主义疗法、正念减压疗法和家庭治疗为核心技术，在情感障碍、睡眠障碍、心身疾病、心理咨询与治疗、老年精神障碍等领域，广泛开展各项特色化心理治疗。",
                        "doctor_list":["张三","李四","王五"],
                        "schedule":{
                            "周一":{
                                "上午":["周一上午1","周一上午2"],
                                "下午":["周一下午1","周一下午2"]
                            },
                            "周二":{
                                "上午":["周二上午1","周二上午2"],
                                "下午":["周二下午1","周二下午2"]
                            },
                            "周三":{
                                "上午":["周三上午1","周三上午2"],
                                "下午":["周三下午1","周三下午2"]
                            },
                            "周四":{
                                "上午":["周四上午1","周四上午2"],
                                "下午":["周四下午1","周四下午2"]
                            },
                            "周五":{
                                "上午":["周五上午1","周五上午2"],
                                "下午":["周五下午1","周五下午2"]
                            },
                            "周六":{
                                "上午":["周六上午1","周六上午2"],
                                "下午":["周六下午1","周六下午2"]
                            },
                            "周日":{
                                "上午":["周日上午1","周日上午2"],
                                "下午":["周日下午1","周日下午2"]
                            }
                        }
                    }
                
            }
        }

    },
    */
    {
        url:'/user/query_department',
        type:'post',
        response: config =>{
            let params=JSON.parse(config.body).params;
            console.log("用来获取departinfo的参数是:",params.depart_name);
            return {
                data:{
                        "name":params.depart_name,
                        "intro":"精神科成立于20世纪80年代，是全国综合医院成立最早的精神科门诊之一。科室现有5名医生，1名护士，其中副主任医师2人、主治医师1人，博士1名、硕士4人。以认识领悟疗法、人本主义疗法、正念减压疗法和家庭治疗为核心技术，在情感障碍、睡眠障碍、心身疾病、心理咨询与治疗、老年精神障碍等领域，广泛开展各项特色化心理治疗。",
                        "doctor_list":["张三","李四","王五"],
                        "schedule":{
                            "周一":{
                                "上午":["周一上午1","周一上午2"],
                                "下午":["周一下午1","周一下午2"]
                            },
                            "周二":{
                                "上午":["周二上午1","周二上午2"],
                                "下午":["周二下午1","周二下午2"]
                            },
                            "周三":{
                                "上午":["周三上午1","周三上午2"],
                                "下午":["周三下午1","周三下午2"]
                            },
                            "周四":{
                                "上午":["周四上午1","周四上午2"],
                                "下午":["周四下午1","周四下午2"]
                            },
                            "周五":{
                                "上午":["周五上午1","周五上午2"],
                                "下午":["周五下午1","周五下午2"]
                            },
                            "周六":{
                                "上午":["周六上午1","周六上午2"],
                                "下午":["周六下午1","周六下午2"]
                            },
                            "周日":{
                                "上午":["周日上午1","周日上午2"],
                                "下午":["周日下午1","周日下午2"]
                            }
                        }
                    }
                
            }
        }
    },
    /*
    {
        url:'/getdoctorinfo',
        type:'get',
        response:()=>{
            return {
                data:{
                    "number":2,
                    "doctor_list":[
                        {
                             "id": 1000001,
                             "name": "张三",
                             "department":"皮肤科",
                             "age":35,
                             "intro":"张三毕业于浙江大学医学系，擅长荨麻疹等等疾病的治疗，曾获得浙江省名医称号。"
                        },
                        {
                             "id": 1000043,
                             "name": "张三",
                             "department":"骨科",
                             "age":42,
                             "intro":"张三毕业于浙江大学医学系，擅长骨科手术，是本医院最有名望的骨科专家。"
                        }
                    ]
                 }
                
            }
        }

    },
    */
    {
        url:'/user/query_doctor',
        type:'post',
        response: config =>{
            let params=JSON.parse(config.body).params;
            console.log("用来获取医生信息的参数是:",params.doctor_name,params.depart_name);
            return {
                data:{
                    "number":2,
                    "doctor_list":[
                        {
                             "id": 1000001,
                             "name": params.doctor_name,
                             "department":params.depart_name,
                             "age":35,
                             "intro":params.doctor_name+"毕业于浙江大学医学系，擅长荨麻疹等等疾病的治疗，曾获得浙江省名医称号。"
                        },
                        {
                             "id": 1000043,
                             "name": params.doctor_name,
                             "department":params.depart_name,
                             "age":42,
                             "intro":params.doctor_name+"毕业于浙江大学医学系，擅长骨科手术，是本医院最有名望的骨科专家。"
                        }
                    ]
                 }
                
            }
        }
    },
    /*
    {
        url:'/getqueryschdule',
        type:'get',
        response:()=>{
            return {
                data:{
                    "data_info":["2022-04-18_1","2022-04-20_3"],
                    "周一":{
                        "呼吸内科":{
                            "上午":["呼吸内科1","呼吸内科2"],
                            "下午":["呼吸内科3","呼吸内科4"]
                        },
                        "消化内科":{
                            "上午":["消化内科1","消化内科2"],
                            "下午":["消化内科3","消化内科4"]
                        },
                        "神经内科":{
                            "上午":["神经内科1","神经内科2"],
                            "下午":["神经内科3","神经内科4"]
                        }
                    },
                    "周三":{
                        "呼吸内科":{
                            "上午":["呼吸内科5","呼吸内科6"],
                            "下午":["呼吸内科7","呼吸内科8"]
                        },
                        "消化内科":{
                            "上午":["消化内科5","消化内科6"],
                            "下午":["消化内科7","消化内科8"]
                        },
                        "神经内科":{
                            "上午":["神经内科5","神经内科6"],
                            "下午":["神经内科7","神经内科8"]
                        }
                    }
                }
                
            }
        }
    },
    */
    {
        url: '/user/query_schedule',
        type: 'post',
        response: config =>{
            let params=JSON.parse(config.body).params;
            console.log("值班表查询的参数是:",params.weekdays,params.departments);
            return {
                data:{
                    "data_info":params.weekdays,
                    "周一":{
                        "呼吸内科":{
                            "上午":["呼吸内科1","呼吸内科2"],
                            "下午":["呼吸内科3","呼吸内科4"]
                        },
                        "消化内科":{
                            "上午":["消化内科1","消化内科2"],
                            "下午":["消化内科3","消化内科4"]
                        },
                        "神经内科":{
                            "上午":["神经内科1","神经内科2"],
                            "下午":["神经内科3","神经内科4"]
                        }
                    },
                    "周三":{
                        "呼吸内科":{
                            "上午":["呼吸内科5","呼吸内科6"],
                            "下午":["呼吸内科7","呼吸内科8"]
                        },
                        "消化内科":{
                            "上午":["消化内科5","消化内科6"],
                            "下午":["消化内科7","消化内科8"]
                        },
                        "神经内科":{
                            "上午":["神经内科5","神经内科6"],
                            "下午":["神经内科7","神经内科8"]
                        }
                    }
                }
                
            }
        }
    }


]